[
  {
    "id": "BL01",
    "title": "How to save money on new clothes",
    "description": "According to the ONS the average household in the UK spent almost £1200 on clothing and shoes in 2020.  With the cost of living soaring, namely on essentials like food, fuel and heating bills, it would seem that cutting down the clothes expenditure can be a good place to save a few pounds. ",
    "content": [
      {
        "img": "thumbnail1.jpg",
        "text": "According to the ONS the average household in the UK spent almost £1200 on clothing and shoes in 2020.  With the cost of living soaring, namely on essentials like food, fuel and heating bills, it would seem that cutting down the clothes expenditure can be a good place to save a few pounds.  So, here's my top tips to save cash on clothes."
      },
      {
        "img": "blog1pic1.jpg",
        "text": "\n\n1.  Purge your wardrobe and sell off what you don't wear.  \n\nAccording to Love Your Clothes, almost 1/3 of what is hanging in your wardrobe hasn't been worn in over a year.  In my experience as a stylist, I would say that figure is pretty conservative; most of us wear about 20% of the clothes we own 80% of the time, meaning there's 80% of our wardrobes only getting worn about 20% of the time.  Starting with a good clear out of those things that we're not wearing could turn up some sellable items that can go to a good new home whilst also earning you a few pounds.  You can sell your unwanted clothes (that are in excellent condition) on sites like Vinted, Depop and eBay or through dress agencies.  You could also sell off other items to a company that pays you by weight such as cash for clothes companies or if you don't want to sell them,  donate to your local charity shop.  Clearing out the clutter helps you see what wearable clothes you own and might even generate some cash too.\n\n2.  Wear more of what you already own more often\n\nThe clothes you already own are the most financially savvy (and sustainable) things you can wear.  You've already spent the money on them (and all the energy has already gone into their production), so extending the life and getting the most value out of what you own is the number one thing you can do.  Often we overlook items in the wardrobe, because we can't see them (perhaps at the back or under another item on a hanger) or because we get bored and don't always see how we can breathe new life into them.  In our Facebook group, we set regular challenges to create new outfits from what we already have in the wardrobe - to break open our habits and find new ways to wear our clothes.  Just by extending the life of our clothes by 3 months, we reduce the waste, water and carbon footprint of those items by as much as 10%, and as we've already spent the money on them, they're a zero expenditure option moving forward!  My dad has newer clothes for 'best' and then wears them at home, and then as they get scruffier, for gardening, and when they're gone beyond gardening wear he cuts them up and uses them for rags and dusters, extracting every ounce of value from those items!"
      },
      {
        "img": "blog2pic1.jfif",
        "text": "\n\n3.  Buy well, buy once\n\nIf we think of our purchases on a cost per wear basis, a pair of jeans that cost £100 and gets worn 100 times, has a cost per wear of £1.  A £20 pair of jeans that gets worn once has a cost per wear of £20.  So the more we can wear something, the lower the cost per wear.  \\n\\nThink about the pair of jeans I just described.  If your £100 pair of jeans is a perfect fit, an excellent quality fabric and something you wear regularly, you're far more likely to wear them over and over again.  If you buy a so-so pair that go baggy at the knees after a couple of hours, or start to rub, dig or slip down, you'll soon get fed up of them.  If you're going to buy something, make sure the fit is excellent, the quality is made to last, and it is something you love.  The slow fashion movement might mean splashing out a bit more initially on a winter coat, but making sure that coat lasts you for years rather than months.\\n\\n4.  Buy only what you need\\n\\nThis one might sound obvious, but I ask clients 'what do you need in your wardrobe?' and they're often not quite sure.  I encourage my clients to organise and sort their wardrobes twice a year and to create a shopping list of what they need for the coming season (Find out more about this method in the Wardrobe Revival blog and the Fluid Wardrobe blog).  Focusing on a list avoids duplicate purchases, and mistakes we can be tempted to purchase but never get round to wearing.\n\n5.  Repair and recycle\\n\\nThe longer we can keep wearing and loving our clothes, the better for our pockets and the better for the planet.  Acquiring skills in mending and repairing means being able to navigate a few youtube videos, and for the more adventurous, you could try upcycling old garments into something new!  I particularly love the how to tips on the Love Your Clothes website.  Here's a silk kimono I made from old pieces of silk, which I absolutely adore: \n6.  Buy preloved clothes\n\nYou can literally save thousands of pounds by exploring preloved clothes rather than new.  In my year of no new clothes at all in 2014 I saved a small fortune, and have done every year since.  Even if you're not someone who likes the idea of browsing a charity shop, a simple search on ebay will show you how many things are available for sale at a heavily discounted price with the new tags still attached.  Even our dress agency has so many 'new' clothes that a previous owner has never gotten around to wearing, so preloved doesnt have to mean worn.  And if you love a browse or a rummage, you can save a small fortune buying preloved clothing instead of new.  It's better for your pocket, and better for the planet too.  To give you an example, I once bought a beautiful big red leather handbag from a charity shop and it cost me 20p.  It was in fantastic condition and I have used and used and used that bag.  By selling off what you don't wear regularly and using that money to buy preloved clothes, you can get your annual budget down to next to nothing.  Here's a Pringle cashmere jumper I bought in a charity shop for £1.  How much would that have cost had I bought it new?\n7.  Rent, borrow or swap\n\nThe most wasteful and often the most expensive outfit is the one you wear once.  Buying something to wear as a guest to a wedding or an event can set you back quite a tidy sum, and then how often do you wear that outfit again?  So if you're invited to a formal event and don't have something already, why not consider renting an outfit?  There's lots of clothing rental companies out there to have a look at, and it's considerably cheaper than buying a whole new outfit.  You could also consider borrowing something from a friend (which cost me the price of a bunch of flowers and a dry clean).  And if you don't have a do to go to but want some new to you things in the wardrobe, you could try swapping.  Invite a group of friends over with the clothes they don't wear, and everyone has a try on and a swap.  It can be a very entertaining evening, and if you check out your local area, some places organise clothes swapping events.\n\n8.   Have to buy new?  Get a discount!\n\nThere will be some things you need that you have to buy new - underwear, socks, nightwear, swimwear etc.  Or there might be something you've seen for sale and you have simply fallen in love with it and know that its just what you need.  Before you click to add the item to your shopping cart, do a search online to see if the store in question has any current discount vouchers.  Often you can bag free delivery, or a 10% discount with a voucher code.  Even if you're in the shop and spot something, it's worth whipping out the phone to see if it would be cheaper to buy it online.  Sometimes signing up for the stores newsletter can earn you a discount, so it's worth checking.  And if you can manage it, keep a list of what you like and then wait for  the sales to roll around.  \n\nDo you have any more tips on how to save money on clothes?  If so, do share in the comments below and share our tips with any friends who want to cut back on their spending too!\",\n"
      }
    ],
    "thumbnail": "thumbnail1.jpg",
    "author": "Victoria Lochhead",
    "time": "July 11, 2022"
  },
  {
    "id": "BL02",
    "title": "The Importance of Second Hand Shopping",
    "description": "Hello everyone! I hope you're having a nice day and you weren't too offended by the cheesy introduction. So, second hand shopping. I think a lot of people get weirded out by the idea of wearing someone else's clothes, and if it's not that, they think they'll only find old granny skirts and cardigans.",
    "content": [
      {
        "img": "blog2thumbnail.jpg",
        "text": "\nHello everyone! I hope you're having a nice day and you weren't too offended by the cheesy introduction. So, second hand shopping. I think a lot of people get weirded out by the idea of wearing someone else's clothes, and if it's not that, they think they'll only find old granny skirts and cardigans. Well, hopefully I can help anyone who's feeling like that realise how long the list of positives is."
      },
      {
        "img": "blog2pic1.jfif",
        "text": "\nYou're helping the environment.\n\nIn the good ol days, fashion was produced to last for a long time and be worn for many years. Today fashion is quicker paced and the industry is trying to make people believe they need to have the latest styles each season (and throw away the stuff they bought just some months ago). If you wear something that another person has worn before, you prolong the life of this garment. If a lot of people do that, less new clothes are produced, as well as less waste. It's fashion's way of recycling!\nYou save money.\n\nProbably the most obvious reason is: you get the garment, shoes, accessory or handbag cheaper. A lot cheaper. Depending on where and what brand or type of clothing you buy, you might get it for a fraction of the original price. This means you can either get more clothes for the same budget or better quality for the same budget. Or you simply spend less on what you wanted to buy!\n\n"
      },
      {
        "img": "blog2pic2.jfif",
        "text": "You help by buying.\n\nWhen you buy at second hand shops like Cancer Research and Oxfam, you do not only save money and help reduce waste. The money these shops make from selling second hand clothes are put towards such amazing causes, and the sales people there are all volunteers and work for free. (Be nice to them and appreciate what they do!). It's so amazing to be able to find something really nice and at the same time help someone else.\nYou can find really unique, beautiful pieces.\n\nYou could think that buying something from a few months or seasons ago is outdated and not 'fashionable' any more. You don't need to buy that 80s lookalike shirt from H&M, you can buy one that is really from the 80s at a vintage shop that no one else has! And if there's, for example, a lot of mint green around on the high street and it's not for you, you have emerald green from 1996, hunter green from 2003, sea green from 2007... I will admit I just did research on the colour green. \n\nYou change the lives of workers.\n\nThis is the most important one for me. If you haven't seen the True Cost, which I highly recommend you do, it really delves into the lives of garment workers and all the hardships they go through. It makes everything feel very real and really touched me. You can read my previous post for some book recommendations on this subject, but, to summarise, the conditions these poor workers have to work  in and how little they get paid is disgusting. Just by being aware of how much you buy, or realising that you may not wear that dress you've got your eye on enough, can make such a huge difference. Every documentary I watch, every book I read makes me more and more determined to make a change, and, make others aware of what I'm so passionate about.\n\nBACK TO TOP\nThe Importance of Second Hand Shopping\n6.1.17\n\n\nIt was an ordinary day: Edie received two packages in the post (braces and a t-shirt), and decided to use them in an outfit post. She managed to, somehow, squeeze into her jeans she'd lived in since April, and walked downstairs with her camera. Her mum asked where her new top was from - Depop. Then, she realised EVERYTHING she was wearing was second hand... via depop. And the post ideas came flooding in.\n\n\nHello everyone! I hope you're having a nice day and you weren't too offended by the cheesy introduction. So, second hand shopping. I think a lot of people get weirded out by the idea of wearing someone else's clothes, and if it's not that, they think they'll only find old granny skirts and cardigans. Well, hopefully I can help anyone who's feeling like that realise how long the list of positives is.\n\nYou're helping the environment.\n\nIn the good ol days, fashion was produced to last for a long time and be worn for many years. Today fashion is quicker paced and the industry is trying to make people believe they need to have the latest styles each season (and throw away the stuff they bought just some months ago). If you wear something that another person has worn before, you prolong the life of this garment. If a lot of people do that, less new clothes are produced, as well as less waste. It's fashion's way of recycling!\n\nYou save money.\n\nProbably the most obvious reason is: you get the garment, shoes, accessory or handbag cheaper. A lot cheaper. Depending on where and what brand or type of clothing you buy, you might get it for a fraction of the original price. This means you can either get more clothes for the same budget or better quality for the same budget. Or you simply spend less on what you wanted to buy!\n\nYou help by buying.\n\nWhen you buy at second hand shops like Cancer Research and Oxfam, you do not only save money and help reduce waste. The money these shops make from selling second hand clothes are put towards such amazing causes, and the sales people there are all volunteers and work for free. (Be nice to them and appreciate what they do!). It's so amazing to be able to find something really nice and at the same time help someone else.\n\n\n\nYou can find really unique, beautiful pieces.\n\nYou could think that buying something from a few months or seasons ago is outdated and not 'fashionable' any more. You don't need to buy that 80s lookalike shirt from H&M, you can buy one that is really from the 80s at a vintage shop that no one else has! And if there's, for example, a lot of mint green around on the high street and it's not for you, you have emerald green from 1996, hunter green from 2003, sea green from 2007... I will admit I just did research on the colour green. \n\nYou change the lives of workers.\n\nThis is the most important one for me. If you haven't seen the True Cost, which I highly recommend you do, it really delves into the lives of garment workers and all the hardships they go through. It makes everything feel very real and really touched me. You can read my previous post for some book recommendations on this subject, but, to summarise, the conditions these poor workers have to work  in and how little they get paid is disgusting. Just by being aware of how much you buy, or realising that you may not wear that dress you've got your eye on enough, can make such a huge difference. Every documentary I watch, every book I read makes me more and more determined to make a change, and, make others aware of what I'm so passionate about.\n\n\nThese are only a few of all the benefits of shopping second hand. I really hope this post has inspired/helped you in some way! I'll definitely be incorporating a lot more ethical and sustainable fashion into my blog, so you can be expecting a lot of that! Do you shop second hand often?\n"
      }
    ],
    "thumbnail": "blog2thumbnail.jpg",
    "author": "Edie",
    "time": "6 January 2022"
  },
  {
    "id": "BL03",
    "title": "5 Good Reasons Why You Should Shop Second Hand",
    "description": "I’ve said it before: I do not shop second hand. But I also know that rules were meant to be broken and that ‘never say never‘ actually is a phrase worth living by.",
    "content": [
      {
        "img": "blog3thumbnail.jfif",
        "text": "I’ve said it before: I do not shop second hand. But I also know that rules were meant to be broken and that ‘never say never‘ actually is a phrase worth living by. Because so it happened that I fell in love with second hand shopping!\n\nMy sustainable fashion journey has now lasted almost 3 years. And within that time I’ve practiced complete minimalism in terms of shopping. I basically haven’t shopped unless there’s been an absolute need. And there rarely is, since my wardrobe is bulging by the seams. Just like yours is, right?\n\nIf I have shopped I’ve focused on higher price range brands, even luxury brands. Because when you shop less, you have more money in your disposal, and can thus afford much better. Until just about a month ago I accompanied my friend to a second hand marketplace.\nThis particular marketplace is more of a high-end marketplace for second hand clothes than those shops that sell donated clothes. The clothes have to be in mint condition, and a lot of them are highly branded. No surprise then that all of a sudden I found myself inclined to shop second hand!\n\nSince then I found myself in a second hand shop (or 3) on our recent holiday in Lithuania. And oh boy! To shop second hand in countries where women are quite particular about their style is seriously a wonderful thing. I found suitcases’ worth of clothes to buy. But settled for a pair of printed denim shorts.\n\nDo you already shop second hand? If not, you sure should! Because:\n"
      },
      {
        "img": "blog3pic1.jfif",
        "text": "#1 It’s the most sustainable way to shop clothes\nAs I mentioned in this post about stopping buying plastic clothes, there are now enough clothes on this planet to dress 46 billion people.\n\nObviously, the humankind doesn’t have the capacity to wear that many clothes, so most of the clothes on this planet right now end up straight to landfill. There the clothes will create greenhouse gases for hundreds of years to come.\n\nSo, it goes without saying that the most sustainable clothes are the ones we already own. Take care of what you have, value them and re-style them to create whole new looks.\n\nAnd IF you have to buy something new, definitely opt for second hand. There are different kinds of second hand stores, from vintage to donated to high-end brand boutiques. Find the stores close to you and go and have a look at what they have to offer. In the process, you make a difference.\n#2 The money goes to people who might actually need it\nThis point was brought up in my Instagram post about second hand shopping by Heather from Quinn of the Nerds blog. And it’s a bloody good point!\n\nWhen you shop fast fashion you’re supporting a billionaire to buy another super-polluting yacht. When you shop second hand your money is going to people who often are in actual need for it.\n\nThere’s a lot of power within our wallets and being able to choose to shop second hand instead of fast fashion is a privilege. Not many people in the world have a choice.\n\nIt also works the other way round: selling your unwanted/unworn clothes in a second hand store. This way you’re giving someone, who might be in a less fortunate situation, the possibility to dress well. Assuming that what you sell is of good quality and in good condition, of course.\n"
      },
      {
        "img": "blog3pic2.jfif",
        "text": "#3 You can afford it\nSecond hand shopping doesn’t discriminate in regards to our level of income. Even within Europe people earn very, very differently. In some countries people can live magnificently with the salary they receive, whereas in others people literally live from one paycheck to another.\n\nQuality second hand stores ensure that we can all afford to look stylish. And as feeble as it may sound, the way we look does actually have a massive impact on our overall well-being and confidence. Don’t you feel much better leaving the house when you know you look good?\n\nWe can all afford a style we love when we shop second hand.\n#4 Your chances of finding actual treasures are HIGH\nContinuing on that theme, second hand stores are treasure troves! I’ve often heard people purchasing proper luxury brand items from second hand stores for a real bargain. And even I found some nice brand stuff in the local second hand store.\n\nLuxury brand items can be on the more expensive side even in the second hand stores. But let’s be honest here, there’s a massive difference between paying £50 for a brand bag in a second hand store versus its original price of £2000.\n\nIf you want to make sure that you only purchase quality brand stuff when buying second hand, there are so many great websites and even Facebook groups where people sell their luxury items. Vestiaire is probably the best known location for luxury-hungry second hand shoppers.\n#5 Your style will be 100% unique\nI’m someone who has from a very young age prided herself on standing out from the crowd. I’ve never followed trends, and can’t see myself doing so in the future either. Trends are boring. Trends mean that you look like everybody else, and what’s the fun in that?\n\nUnique style is what gets you noticed, what catches the compliments, and what people will remember. Never underestimate adding a unique twist to your outfit when going to a job interview or a networking event. By playing it safe you ensure that you will go unnoticed.\n\nWe don’t want that now, do we? We want to shine, sparkle, be noticed and admired! I know these are not words that come to your mind when you hear the words “shop second hand”. But they could be! I didn’t think so, but I have now been proven wrong.\n\nThere is real potential in building a strong, personal style out of a second hand store.\nAs someone who shunned second hand shopping as something that is of lower quality and worth leaving for those who can’t afford ethically priced brands, I now admit myself greatly mistaken. I was unaware, ignorant and assumed things. Assuming things is never the way to go because 99% of the time we assume wrong.\n\nBut I stand corrected! It is NOT sustainable to shop new clothes, period. The only properly sustainable option is to shop your own wardrobe or second hand.\n\nDo you shop second hand? What’s the greatest find you’ve made so far in a second hand store? I’m super curious, so please, comment below! ♥"
      }
    ],
    "thumbnail": "bl3thumbnail.jfif",
    "author": "Ali Azizi",
    "time": "10 july 2022"
  },
  {
    "id": "BL04",
    "title": "6 Tips for Mastering Secondhand Shopping",
    "description": "It’s here, it’s here! The official Going Zero Waste guide to second hand shopping. \n\nI love second hand shopping. It’s been my preferred method since I started shopping for myself around middle school.",
    "content": [
      {
        "img": "blog4thumbnail.jfif",
        "text": "It’s here, it’s here! The official Going Zero Waste guide to second hand shopping. \n\nI love second hand shopping. It’s been my preferred method since I started shopping for myself around middle school. \nI remember my first trip to the thrift store. I was in drama club (of course) and we went to Goodwill to buy costumes for a show. \n\nWhen I was at this mega Goodwill in San Antonio, TX, I found so many cool pieces of clothing! After that eye opening trip I would beg my mom to go to Goodwill and the answer was always, “No.” \n\nMy mom was not a huge fan of secondhand shopping. It wasn’t until recently that she came around. Finding designer duds with tags still attached on eBay for a fraction of the cost!? She was sold. \n"
      },
      {
        "img": "blog4pic1.jfif",
        "text": "1. get comfy: \nWhen, I’m shopping, I’m a woman on a mission. I was never the kind of girl who wanted to go to the mall and browse. I like to shop and try on very efficiently. \n\nThis means, slip on shoes with socks. Yes, I look like a total nerd, but it’s SO much easier to try on shoes and clothes in the dressing room. I don’t like putting my bare feet on dressing room floors. It grosses me out. \n\nI also typically wear a dress that easily pulls on and off. This way I can be in and out of the dressing room in a flash.\n\nMoral of the story, dress like you’re going to be undressing…. a lot. \n\n2. be prepared to leave: \nThis one is huge, and what I struggle with most. If I’ve spent 30 minutes combing through racks and another 30 minutes trying all of the things on, you can bet I want to leave with a reward. \n\nIt just doesn’t work that way. You will leave empty handed more often than not. In order to keep my wardrobe small, functional, and not waste money – I have to LOVE a piece. \n\nI mean really, really LOVE it. \n\nIf it doesn’t fit perfectly, put it back. If you don’t immediately say, “This is one of the best things I’ve ever put on my body!” put it back. \n\nWhen in doubt… put it back. \n\nHow many times have you regretted leaving something on the shelf? Probably one one or two times. \n\nNow, how many times have you bought something, put it in your closet, not worn it, and regretted buying it? Probably more times than you can count. \n\nBetter safe than sorry. Walk out empty handed. \n\n3. know thy wardrobe: \nBefore shopping, you should intimately know your wardrobe. We’re often drawn to similar items. My kryptonite is sweaters. I have at least 20 sweaters, and around 5 of them are pink. \nSo, when I go to the thrift store and see an adorable pink sweater OF COURSE I’m going to pick it up because I love pink sweaters!!!\n\nBecause I know my wardrobe, I have the foresight to put it back because I don’t need anymore pink sweaters. \n\nYou have to know what’s in your wardrobe before you go shopping.\nSo, when I go to the thrift store and see an adorable pink sweater OF COURSE I’m going to pick it up because I love pink sweaters!!!\n\nBecause I know my wardrobe, I have the foresight to put it back because I don’t need anymore pink sweaters. \n\nYou have to know what’s in your wardrobe before you go shopping.\nWhat colors do you reach for most in your wardrobe? \nAre there any particular colors you love, but don’t wear? I love the color green, but I just don’t wear it very often. \n\nI’m not drawn to wearing green so if I found a gorgeous green dress, even if I love the fit, chances are I’d pass over it simply because it wasn’t one of my favorite colors to wear. \n\nWhat are your favorite pieces to wear and why?\nOff the top of your head what are the five favorite pieces in your closet? More importantly why do you like wearing them? \n\nYellow Shirt Dress: It flatters my shape, it’s a happy color, it has embroidery which is quirky, fun, and bespoke.\n"
      },
      {
        "img": "blog4pic2.jfif",
        "text": "Navy Blue Dress: It really flatters my shape, I like the short sleeves, I like how heavy it is and how well it hangs.\nPink Striped Sweater: I love pink sweaters and it fits perfectly. I love wearing it with shorts! \nWhite Cable Knit Sweater: It’s tight but not too tight. I feel like a tennis player when I wear it. \nBlue Wrap Skirt: I love the pattern. I love how it accentuates my waist and how it can be tied a number of ways. \nAfter reading my list, what would you say are some of the important characteristics of clothing? There’s a couple of words that are repeated like things that accentuate my waist. \n\nI’m pear shaped so having clothing that comes in at the waist and then drapes over my hips is very, very flattering. \n\nSo, if I see an empire waisted dress, low-rise jeans, or long tunic tops no matter how much I love them. They probably won’t get a ton of use in my closet because my wardrobe isn’t built for that style.\n\nI don’t have the appropriate styles to mix and match and layer. The piece will go unworn. \n\nAre there recurring brands you like? \nI have a couple of brands that I just love. I know they fit my body and my aesthetic perfectly! I love NYDJ for jeans. I love Amour Vert because they design for pear shaped women. I also love Lacoste.\n\nI can easily find NYDJ and Lacoste second hand because I know it will fit. When you find brands that you like and know how they fit your body, it will make your life easier. \n\nIt will help shape your list and give you direction when shopping! See if you can find a few brands that you love the fit, look, and aesthetic. \n\n4. know thy self: \nI am pear shaped which means there are certain styles that flatter me and certain styles that don’t. Pear shaped means the largest part of my body is my hips.\n\nWhen I’m dressing I can balance my hips by adding dimension to my shoulders and chest through a ruffle, cinching in my waist and having plain bottoms.\n\nNow, these are guidelines not rules. There’s a way for every body shape to wear every style, you just have to be a little more careful. \n\nOne of the easiest ways (especially when shopping secondhand online) is to know your measurements! \n\nIf I have a shirt that’s 22″ in length, it will look TERRIBLE on me. If it’s 24″ or 18″ it will be fine. But, when it’s at 22″ it hits the exact largest part of my body bringing all of the attention to it. \nIf you can pinpoint why you don’t like the way things look, you can make better decisions in the dressing room. Here are a couple of things you should know. \n\nMeasure your bust, waist, top of hip, full hip and inseam. \nKnow what colors flatter your skin tone\nKnow your body shape and what type of silhouettes are flattering and unflattering\nFigure out your style! \nCheck out this post on finding your style and this post about how I found my style and how it’s evolved. \n5. have a game plan: \nBefore going shopping, you should know what you’re looking for.\n\nWhat are the gaps in your wardrobe? Do you need another pair of jeans? Maybe you need more tank tops for summer? Or more winter blouses for work?\n\nWrite down what’s missing from your wardrobe and focus your attention on finding those things. If something else jumps out at you, by all means give it a try, but try to focus on the list. \n\nBy staying focused on the list and task at hand you’re more likely to walk away with something you’ll actually wear. \n\n6. know where to shop: \nThere are different levels of secondhand shopping ranging from Goodwill to high end consignment shops. The more work you have to do with hunting through the bins and racks, the cheaper they are. \n\nThe more highly curated, the more you pay for that service."
      }
    ],
    "thumbnail": "blog4thumbnail.jfif",
    "author": "KATHRYN KELLOGG",
    "time":"AUGUST 10, 2020"
  },
  {
    "id": "BL05",
    "title": "Do you shop for second-hand clothes? You’re likely to be more stylish",
    "description": "Not only is second-hand shopping good for the planet and your wallet, our new research finds the more style-conscious you are, the more likely you are to shop for second-hand clothes and accessories.",
    "content": [
      {
        "img": "blog5thumbnail.jfif",
        "text": "Not only is second-hand shopping good for the planet and your wallet, our new research finds the more style-conscious you are, the more likely you are to shop for second-hand clothes and accessories.\n\nIn the 2020-21 financial year, 72% of Australians purchased at least one item of second-hand clothes – but we wanted to know more about people who were shopping second hand.\n\nIt is often assumed those who shop for second-hand clothes do so to save money or reduce their impact on the environment.\n\nIn our study, we found the higher people rate on style-consciousness, the more likely they are to shop second hand. In fact, style-consciousness was a bigger predictor of second-hand shopping than being frugal or ecologically-conscious."
      },
      {
        "img": "blog5pic1.jfif",
        "text": "\n\nStyle-conscious shoppers are very different from fashion-conscious shoppers. Fashion is all about the “new”: fashion is a novelty and constantly evolving.\n\nStyle, on the other hand, is about expressing long-term individual identity.\nThe problem with fashion\nFashion shoppers are used to a continuous supply of new trends and “fast fashion” products. Fast fashion works quickly to replicate an ever moving stream of fashion trends, generating large volumes of low-quality apparel.\n\nThe impact of fast fashion on the environment is significant and well-documented. Globally, the fast fashion industry creates 92 million tonnes of waste per year and uses 79 trillion litres of water. Less than 15% of clothes are recycled or reused.\n\nPoorly made and low-quality fast fashion items are a significant problem for charity stores, who are forced to send fast fashion items they can’t sell to landfill."
      },
      {
        "img": "blog5pic2.jfif",
        "text": "\n\nBut, going against this fast fashion trend, growing numbers of people are shopping for second-hand clothing and accessories.\nThe problem with fashion\nFashion shoppers are used to a continuous supply of new trends and “fast fashion” products. Fast fashion works quickly to replicate an ever moving stream of fashion trends, generating large volumes of low-quality apparel.\n\nThe impact of fast fashion on the environment is significant and well-documented. Globally, the fast fashion industry creates 92 million tonnes of waste per year and uses 79 trillion litres of water. Less than 15% of clothes are recycled or reused.\n\nPoorly made and low-quality fast fashion items are a significant problem for charity stores, who are forced to send fast fashion items they can’t sell to landfill.\n\nBut, going against this fast fashion trend, growing numbers of people are shopping for second-hand clothing and accessories.\nWhat makes a second-hand shopper?\nWe surveyed 515 Australian female-identifying consumers looking at their “orientation” (the preference to behave in a certain way) when it comes to shopping. Each participant was measured for their orientation towards frugality, how ecologically conscious they are, their level of materialism, how prone they are towards nostalgia, their fashion-consciousness and their style-consciousness.\n\nWhile we found there are frugal and ecologically-conscious second-hand shoppers, our research revealed overwhelmingly that style-consciousness is the greatest predictor of second-hand fashion shopping.\n\nPeople who scored highly on the style-consciousness scale were more likely to shop for second-hand clothes than any of the other orientations.\n\nA style-conscious person expresses themselves through their clothes. These shoppers want clothes that complement their personal style and values. They look for authentic and original pieces and avoid mainstream trends and fast fashion.\nStyle-conscious shoppers buy high-quality, durable clothing and accessories. While fashion-conscious shoppers are constantly buying new clothes to keep up with current trends, style-conscious shoppers buy clothes that are timeless, well-crafted and allow them to express their individual identity over the long-term.\n\nTraditional thrift shops run by charities are responding to consumer demand, reinventing their stores with carefully selected, high-quality clothes, improved merchandising and store design, online sales and improved digital and social media marketing.\n\nThe number of independently owned, highly-curated “pre-loved” stores and online sales platforms is also increasing.\n\nSocial media influencers have driven much of this growth. Their accounts embrace second-hand fashion, the circular economy (which highlights reuse, repair, repurpose and recycle) and promote the notion of #secondhandfirst.\nHelping the planet…with style\nWe hope with increasing numbers of second-hand stores, markets and online platforms selling a range of quality, pre-loved clothes at different price points for different budgets – coupled with the growing acceptance of second-hand shopping – shoppers will consider buying second-hand more often.\n\nFor those who already embrace “not needing new”, not only are you helping the planet – our research shows you are also likely to be doing it with style."
      }
    ],
    "thumbnail": "blog5thumbnail.jfif",
    "author": "Louise Grimmer",
    "time":" April 11, 2022"
  },
  {
    "id": "BL6",
    "title": "How to save money on clothes",
    "description": "The Croft Magazine // As soon as that student loan drops we're all guilty of spending a little too long on the Urban Outfitters website. Here are some simple changes you can make to save money on clothes and shop sustainably this term.",
    "content": [
      {
        "img": "blog6thumbnail.jfif",
        "text": "The Croft Magazine // As soon as that student loan drops we're all guilty of spending a little too long on the Urban Outfitters website. Here are some simple changes you can make to save money on clothes and shop sustainably this term.\n\nIf, like me, you are a bit of a fashionista and spend way too much money on clothes, don’t panic, because there are many ways you can continue to buy the things you love on a budget.\n\nThese are 3 simple steps to change your shopping habits to avoid spending too much on clothing."
      },
      {
        "img": "blog6pic1.jfif",
        "text": "\n\n1) Stick to a budget\n\nThe best tip I can give when it comes to saving money is to make sure you stick to a budget each week or month. That way you will be able to track your spending and feel more in control of your money. Because clothes are one of the things I love to splurge on, I put aside some money each month so that I can treat myself every now and again. This helps to keep my spending healthy, but also to continue to keep up with the latest fashion trends.\n\n2) Use second-hand clothes stores\n\nThe emergence of second-hand online clothes stores such as Depop or Vinted have changed the way many of us shop. Not only is this better for your bank account, but this way of shopping is also much more environmentally friendly because it means you are not contributing to the demand of fast fashion. Sites as such Vinted allow you to swap and sell your unwanted items as well as buy second-hand goods. With the large number of sellers that already use these platforms, there are so many cool pieces to discover! And of course, if you want that authentic shopping experience, why not head to a charity shop or thrift store? You can get some really unique finds!"
      },
      {
        "img": "blog6pic2.jfif",
        "text": "\n\nLikewise charity shops are always in need of old clothes donations, so why not utilise those old pieces you never wear and donate them to a good cause! In Beacon House on campus there is even a British Heart Foundation clothes drop off stand so it couldn’t be easier to recycle old clothing.\n3) Use what you already have\n\nWhy not get creative and restyle your old clothes into new pieces? This could be a great activity to do with friends, and you have the opportunity to create something entirely unique. Recycling old fabrics is another great way to reinvent your style if you are conscious about the environmental impacts of constantly buying new clothes; not to mention it would be healthier for your wallet too!\n\nTry to share and swap your favourite wardrobe pieces! Why not share clothes with housemates and friends, a super easy way of changing up your style and wearing something different without spending any money.\n\nThe University of Bristol Sustainability Department have some great information about sustainable clothing and making small changes to shop ethically!\n\nWe have all spent an unnecessary amount of money after an afternoon at the shops, particularly when this is the easy option to satisfy our fashion desires. But with a little more understanding about the impact this can have on both the environment and our bank accounts, it is so easy to make conscious changes that will benefit our lives and others. After all, we have no excuse, it has never been so easy to bargain hunt for clothes!"
      }
    ],
    "thumbnail": "blog6thumbnail.jfif",
    "author": "Emma Vincent",
    "time":"MAR 07, 2022 "
  }
]