[
  {
    "id": "hat1",
    "name": "Nike Women's Unisex Legacy91 Tech Hat",
    "description": "Item model number : BV1076",
    "size": "11 x 4 x 7 inches; 3.2 Ounces",
    "degree": 95,
    "image": ["hat1.jpg", "hat2.jpg", "hat3.jpg"],
    "date": [
      {
        "sell": "05/06/2022",
        "update": "15/06/2022"
      }
    ],
    "price": 8,
    "gender": "Female",
    "color": "Black",
    "category": "hat1",
    "status": "stock",
    "quantity": 3,
    "amount": 2,
    "tag": ["hats", "woman's hats", "Nike hats"],
    "rate": [
      {
        "id_user": "hat1_user_01",
        "comment": "It occurred to me that in all the different apparel I wear for outdoor adventuring, I did not have a red baseball cap! So off to Amazon I went and found this Nike version. Arrived just in time for a 16-mile hike I did up in Mt Charleston Nevada. I'm all about quality dry-wicking materials on strenuous treks and this hat performed beautifully. Even in the heat, my head stayed cool enough not to distract me from pushing on! Fits well too! I have long hair and was able to pull it all back into a ponytail thru the back-adjustable strap area with ease. A great addition to the multitude of head gear I use.",
        "image": ["hat1.jpg"],
        "video": [],
        "rating_by_star": 5
      },
      {
        "id_user": "hat1_user_02",
        "comment": "I’m happy this particular style hat is still available. Most Lids and Big 5’s now only carry these without the front two panels structured so the whole entire hat is “floppy” and overall looks pathetic when worn. My only issue is that this item will be packeted and sent out in regular bag. Mine came with a huge crease and opted to take a discount and steamed the damage out as best as possible. Hope they go back to making them like how they use to be. Ordering hats online is such a hit or miss experience.",
        "image": ["hatComment1.jpg"],
        "video": [],
        "rating_by_star": 5
      },
      {
        "id_user": "hat1_user_03",
        "comment": "Great fit. Love that there is a slit for you to tuck the strap in the back. I have a small head and you can usually see the strap sticking out in the back from the front view but this hat allows you to hide it.",
        "image": [],
        "video": [],
        "rating_by_star": 5
      },
      {
        "id_user": "hat1_user_04",
        "comment": "Not the same from the photo, got one Nike logo not two, but fits perfectly & comfortable",
        "image": ["hatComment2.jpg"],
        "video": [],
        "rating_by_star": 4
      },
      {
        "id_user": "hat1_user_05",
        "comment": "I always buy the white Nike cap, I have never had an issue before. This cap fits weird and is too large. It looks stupid, the fabric in the front is thicker and doesn’t lay flat with the rest of the cap which is a thin material in the back. The result is that it buckles, or poofs out where the fabric meets when you try to adjust the size. Unwearable, but I’ve already worn it so I guess it’s going to Goodwill. Bummer.",
        "image": [],
        "video": [],
        "rating_by_star": 1
      }
    ]
  },
  {
    "id": "hat2",
    "name": "Sunday Afternoons Women's Coronado Hat",
    "description": "Beach hat or fedora now you don't have to choose. the Coronado is a floppy-brimmed fedora that follows anywhere you go. The fabric blend makes for warm weather comfort and easy packability. Decorative leatherette hatband dresses you up for the links or a late brunch.",
    "size": "medium",
    "degree": 98,
    "image": ["hat4.jpg", "hat5.jpg", "hat6.jpg"],
    "date": [
      {
        "sell": "07/01/2022",
        "update": ""
      }
    ],
    "price": 34,
    "gender": "Female",
    "color": "Beige",
    "category": "hat1",
    "status": "Stock",
    "quantity": 7,
    "amount": 5,
    "tag": ["Women's Sun Hats", "Women's hats"],
    "rate": [
      {
        "id_user": "hat2_user_01",
        "comment": "I seriously cannot even say how much I love this hat! I ordered 2 different Sunday Afternoon hats not knowing which I would like more. They are both really nice but this one is so nice and versatile, it literally goes with everything!",
        "image": ["hatComment3.jpg"],
        "video": [],
        "rating_by_star": 5
      },
      {
        "id_user": "hat2_user_02",
        "comment": "Very comfortable and stylish, love the wide brim. It was a bit out of shape when it arrived but I put it on top of another hat to help train it a little. Adjustable headband with a pretty print inside.",
        "image": ["hatComment4.jpg"],
        "video": [],
        "rating_by_star": 5
      },
      {
        "id_user": "hat2_user_03",
        "comment": "Nice sun hat with adjustable cloth interior sweat band. Very packable; will bend, squish or twist and then return to shape. Slightly heavier duty than I expected, but I was pleased with that. Dries well after getting wet in the pool, but did take several hours.",
        "image": [],
        "video": [],
        "rating_by_star": 4
      },
      {
        "id_user": "hat2_user_04",
        "comment": "This is the Perfect hat. Not to large, not too small, it's just the right size. I was impressed with the quality of the hat. It's well constructed and will be excellent for travel. It is soft enough to pack and easily returns to its original shape. So stylish and can be worn with any outfit.",
        "image": [],
        "video": [],
        "rating_by_star": 5
      }
    ]
  },
  {
    "id": "hat3",
    "name": "Nike Metal Swoosh H86",
    "description": "The Nike Metal Swoosh H86 Adjustable Hat Is Made From 100% Recycled Polyester. It Has An Adjustable Closure For Maximum Comfort And A Truly Personalised Fit. The Embroidered Eyelets Provide Optimal Airflow And Ventilation And Thus Let You Keep A Cool Head During A Match Or During The Day.",
    "size": "12 x 4 x 8 inches; 4 Ounces",
    "degree": 99,
    "image": ["hat7.jpg", "hat8.jpg", "hat9.jpg", "hat10.jpg"],
    "date": [
      {
        "sell": "30/04/2022",
        "update": "01/06/2022"
      }
    ],
    "price": 35,
    "gender": "Female",
    "color": "White",
    "category": "hat1",
    "status": "Stock",
    "quantity": 7,
    "amount": 11,
    "tag": ["Nike Cap", "Men's cap"],
    "rate": [
      {
        "id_user": "hat3_user_01",
        "comment": "I love it! It fits perfect and also readjustable.",
        "image": ["hatComment5.jpg", "hatComment6.jpg"],
        "video": [],
        "rating_by_star": 5
      },
      {
        "id_user": "hat3_user_02",
        "comment": "I bought this hat in blue and black, and they are my absolute favorite to workout in. I have a rather large head for a female, so its hard to find hats that fit. These are super lightweight, dry very quickly, and are easily adjustable. The bill is nice and long and wide so I don't have to worry about the sun on my face outside as well. My only hope is that they add more colors, I will buy them all!! A+++",
        "image": [],
        "video": [],
        "rating_by_star": 5
      },
      {
        "id_user": "hat3_user_03",
        "comment": "This is the second time I purchased this cap. It's perfect for strenuous exercise in the gym as it will not cause your head to overheat. I love that it's lightweight, fits my head well and looks pretty. I think it's perfect for the ladies, but I am not sure how it would fit a guy.",
        "image": [],
        "video": [],
        "rating_by_star": 5
      }
    ]
  },
  {
    "id": "hat4",
    "name": "BOSS Men's Logo Twill Cap",
    "description": "Boss Green basic base cap with embroidered logo on front in contrast color.",
    "size": "XL",
    "degree": 94,
    "image": ["hat11.jpg", "hat12.jpg", "hat13.jpg"],
    "date": [
      {
        "sell": "30/04/2022",
        "update": "01/05/2022"
      }
    ],
    "price": 29,
    "gender": "Male",
    "color": "White",
    "category": "hat2",
    "status": "Stock",
    "quantity": 12,
    "amount": 6,
    "tag": ["Golf Cap", "Men's Cap"],
    "rate": [
      {
        "id_user": "hat4_user_01",
        "comment": "Love the hat!!! The quality is legit thought i would be getting a fake but its legit! And for tge price its perfect!! This hat at there website is $29!! Got it for less then half the price!",
        "image": [],
        "video": [],
        "rating_by_star": 5
      },
      {
        "id_user": "hat4_user_02",
        "comment": "I got it for BF, he doesn’t have big head but it looks kind a small and funny.. he didn’t like it at all even tho he ordered it. I wanted to return, but when I tried it on, it looks hot and sexy on me, so we decided to keep it. I think it would look perfect for women. Just FYI",
        "image": [],
        "video": [],
        "rating_by_star": 4
      },
      {
        "id_user": "hat4_user_03",
        "comment": "Its comfortable and fits lovely, however i wasn't aware it was coming all the way from America!",
        "image": [],
        "video": [],
        "rating_by_star": 5
      }
    ]
  },
  {
    "id": "hat5",
    "name": "Tommy Hilfiger Men’s Baseball Cap",
    "description": "Tommy Hilfiger hat featuring our iconic flag logo. Chain stitch embroidered logo flag. Adjustable metal buckle closure. Six-panel construction with ventilating grommets. Comfort and style make this Tommy Hilfiger cap perfect for everyday wear. This tommy cap is an essential that's hard to beat.",
    "size": "One Size",
    "degree": 96,
    "image": ["hat14.jpg", "hat15.jpg", "hat16.jpg"],
    "date": [
      {
        "sell": "02/09/2022",
        "update": "05/09/2022"
      }
    ],
    "price": 45,
    "gender": "Male",
    "color": "White",
    "category": "hat2",
    "status": "Stock",
    "quantity": 9,
    "amount": 11,
    "tag": ["Baseball Cap", "Men's Cap"],
    "rate": [
      {
        "id_user": "hat5_user_01",
        "comment": "Hello. I cannot speak for any other business that sells on Amazon, but everything we sell is 100% authentic.",
        "image": [],
        "video": [],
        "rating_by_star": 5
      },
      {
        "id_user": "hat5_user_02",
        "comment": "It’s been along time since I’ve purchased a Tommy Hilfiger anything for my husband, the minute I saw the picture of the shot I knew that it looked exactly like the ones he used to where when he was in his 20s, he doesn’t really wear hats anymore now but once he opened it on Christmas morning, he can’t seem to stop wearing it!",
        "image": [],
        "video": [],
        "rating_by_star": 5
      },
      {
        "id_user": "hat5_user_03",
        "comment": "Bought this as a gift for hubby and it fit perfect. He usually wears extra large hats and this fit perfect.",
        "image": [],
        "video": [],
        "rating_by_star": 5
      }
    ]
  },
  {
    "id": "hat6",
    "name": "Rock Band Baseball Cap",
    "description": "There Are More Designs And Styles Of Men'S And Women'S Baseball Caps To Choose From In The Store.",
    "size": "Cap Height 4.5 Inches, Hat Brim 2.7 Inches, Cap Circumference 22.4-23.6 Inches",
    "degree": 98,
    "image": ["hat17.jpg", "hat18.jpg", "hat19.jpg"],
    "date": [
      {
        "sell": "30/07/2022",
        "update": ""
      }
    ],
    "price": 45,
    "gender": "Male",
    "color": "Black",
    "category": "hat2",
    "status": "Stock",
    "quantity": 11,
    "amount": 6,
    "tag": ["Baseball Cap", "Men's Cap"],
    "rate": [
      {
        "id_user": "hat6_user_01",
        "comment": "Bought this as a gift for hubby and it fit perfect. He usually wears extra large hats and this fit perfect.",
        "image": [],
        "video": [],
        "rating_by_star": 5
      },
      {
        "id_user": "hat6_user_02",
        "comment": "Hello. I cannot speak for any other business that sells on Amazon, but everything we sell is 100% authentic.",
        "image": [],
        "video": [],
        "rating_by_star": 5
      },
      {
        "id_user": "hat6_user_03",
        "comment": "Its comfortable and fits lovely, however i wasn't aware it was coming all the way from America!",
        "image": [],
        "video": [],
        "rating_by_star": 4
      }
    ]
  },
  {
    "id": "hat7",
    "name": "EvoShield Flex-fit Hats",
    "description": "Pledge your allegiance to America and the EvoArmy with the EvoShield Black USA Flex-Fit hat. The hat features the American flag backdrop on the front logo. With a breathable mesh back for a cool feel, the hat also has a Flex-Fit band for a comfortable fit.",
    "size": "Small-Medium",
    "degree": 95,
    "image": ["hat20.jpg", "hat21.jpg"],
    "date": [
      {
        "sell": "10/08/2022",
        "update": ""
      }
    ],
    "price": 45,
    "gender": "Male",
    "color": "Black",
    "category": "hat2",
    "status": "Stock",
    "quantity": 20,
    "amount": 12,
    "tag": ["Flex-Fit Hats", "Men's Hat"],
    "rate": [
      {
        "id_user": "hat7_user_01",
        "comment": "Found this hat in my local sporting goods store, but they only had small sizes. I have a huge melon, so being able to find it here was great. It's exactly what I wanted, and in good shape when it arrived. Not mushed, bent, nor the bill all creased up. So far had it for a couple months, and it's light, breathes easy and was easy to form the bill. I curve mine because Im not a tool with a flat brim.",
        "image": [],
        "video": [],
        "rating_by_star": 5
      },
      {
        "id_user": "hat7_user_02",
        "comment": "This is the best fitting hat I’ve owned. Comfortable and awesome quality. It isn’t a flat bill but has a slight bend in the bill, obviously you can bend it to your liking but comes out the box perfect if you don’t like the flat bills.",
        "image": [],
        "video": [],
        "rating_by_star": 5
      },
      {
        "id_user": "hat7_user_03",
        "comment": "I love the way these hats fit and last... I have bought just about every flex fit hat that EvoShield makes...",
        "image": [],
        "video": [],
        "rating_by_star": 4
      }
    ]
  },
  {
    "id": "hat8",
    "name": "Women's Saturday Relaxed Adjustable Cap",
    "description": "The cap every athlete needs in her closet. Simple and classic, the saturday cap is the perfect accessory to throw on for a long run or coffee run. Designed with a lightweight, washed cotton twill, embroidered centerfront adidas logo, and adjustable matte silver slider. Bad hair days never looked so good.",
    "size": "One Size",
    "degree": 98,
    "image": ["hat22.jpg", "hat23.jpg", "hat24.jpg", "hat25.jpg"],
    "date": [
      {
        "sell": "08/10/2022",
        "update": ""
      }
    ],
    "price": 60,
    "gender": "Female",
    "color": "White",
    "category": "hat1",
    "status": "Stock",
    "quantity": 25,
    "amount": 20,
    "tag": ["Woman's Hats", "Adidas"],
    "rate": [
      {
        "id_user": "hat8_user_01",
        "comment": "Adjustable, comfortable and stylish!! I have wore this hat on several hikes and is still looking white",
        "image": ["hatComment7.jpg", "hatComment8.jpg"],
        "video": [],
        "rating_by_star": 5
      },
      {
        "id_user": "hat8_user_02",
        "comment": "I love this hat, super cute. I have a small head and it has the metal adjustment in the back and usually so much of the back of hat sticks out but this does not. When I have to run a few quick errands and do not want to do my hair it is perfect. I also do wear to the gym with work out clothes. I am a hat person and I am so happy I found these hats. I also bought a light grey one with white letters. This is a must",
        "image": [],
        "video": [],
        "rating_by_star": 5
      },
      {
        "id_user": "hat8_user_03",
        "comment": "I read some reviews that this was to small. It fits my head perfectly. I don't have a small head, nor do I have a large head. It fits and looks great!",
        "image": [],
        "video": [],
        "rating_by_star": 4
      }
    ]
  },
  {
    "id": "hat9",
    "name": "Carhartt Men's Canvas Cap",
    "description": "Fights odors. Wicks away sweat. Previously known as the Odessa Cap",
    "size": "One Size",
    "degree": 93,
    "image": ["hat26.jpg"],
    "date": [
      {
        "sell": "01/01/2022",
        "update": ""
      }
    ],
    "price": 42,
    "gender": "Male",
    "color": "Jasper",
    "category": "hat2",
    "status": "Stock",
    "quantity": 28,
    "amount": 13,
    "tag": ["Men's Hat", "Canvas Cap"],
    "rate": [
      {
        "id_user": "hat9_user_01",
        "comment": "Not a lot to say. Good material. Nice stitching. Doesn't yell at me for my bad eating habits.",
        "image": [],
        "video": [],
        "rating_by_star": 5
      },
      {
        "id_user": "hat9_user_02",
        "comment": "I love this hat - totally works for women too. The back is adjustable with Velcro and the hat feels great - very sturdy and comfortable.",
        "image": ["hatComment9.jpg"],
        "video": [],
        "rating_by_star": 5
      },
      {
        "id_user": "hat9_user_03",
        "comment": "If you're like me and do not quite have the flowing locks of mane up top anymore, this is the cheapest and most effective answer to your problems. Forget hairpieces, plugs, implants ect ect. Just stick this bad boy on and reel in the ladies! They'll think you're 22! For an added touch of ruggedness add a button down flannel shirt and you'll have to beat them off with a stick! Here's to your newfound glory! 80 people found this helpful",
        "image": [],
        "video": [],
        "rating_by_star": 4
      }
    ]
  },
  {
    "id": "hat10",
    "name": "Oakley Men's Tinfoil Cap",
    "description": "Fitted baseball cap with curved brim, padded sweatband, and front metal logo icon",
    "size": "Medium-Large",
    "degree": 92,
    "image": ["hat27.jpg", "hat28.jpg", "hat29.jpg"],
    "date": [
      {
        "sell": "20/12/2022",
        "update": ""
      }
    ],
    "price": 48,
    "gender": "Male",
    "color": "Black",
    "category": "hat2",
    "status": "Stock",
    "quantity": 21,
    "amount": 18,
    "tag": ["Men's Hats", "Tinfoil Cap"],
    "rate": [
      {
        "id_user": "hat10_user_01",
        "comment": "Love the cap, fits perfect but I knew my fitted cap size prior to this purchase. Shipping was fast but wish that the packaging was a bit better than a shipping bag.",
        "image": [],
        "video": [],
        "rating_by_star": 5
      },
      {
        "id_user": "hat10_user_02",
        "comment": "I liked this hat from the moment I received it. Fit is good, and takes a day or two for elastic to break in for very comfortable fit. Fits well, looks clean, and that's what I was looking for.",
        "image": [],
        "video": [],
        "rating_by_star": 5
      },
      {
        "id_user": "hat10_user_03",
        "comment": "I prefer hats with limited logos, and this one has worked perfectly. It holds up to washing great (I have not put it in the dryer). It does tend to show dust and stray hairs (especially if you have a dog that sheds a lot.",
        "image": [],
        "video": [],
        "rating_by_star": 4
      }
    ]
  },
  {
    "id": "hat11",
    "name": "Brixton Men's Brood Newsboy Snap Hat",
    "description": "The brood is an eight-panel cut-and-sew snap cap with custom lining and a metal Brixton ribbed shield.",
    "size": "9.84 x 7.87 x 3.94 inches; 0.71 Ounces",
    "degree": 97,
    "image": ["hat30.jpg", "hat31.jpg", "hat32.jpg"],
    "date": [
      {
        "sell": "11/07/2022",
        "update": ""
      }
    ],
    "price": 35,
    "gender": "Male",
    "color": "Grey/Black Herringbone",
    "category": "hat2",
    "status": "Stock",
    "quantity": 22,
    "amount": 18,
    "tag": ["Men's Hats", "Snap Hat"],
    "rate": [
      {
        "id_user": "hat11_user_01",
        "comment": "Real class hat. I’ve tried several peaky blinders style hats before and they’ve been too poofy and mushroom shaped. This one is perfect. Not shaped to your head like a scally, not a ride on top flat cap, it’s a little loose on top, sits low on the head. Couldn’t be happier with it. My head measurement is 23.5”(60mm), got a large and it fits right. It’s not tight but not too loose. Do ya self a fayva and get yous one a these hats, huh",
        "image": ["hatComment10.jpg", "hatComment11.jpg"],
        "video": [],
        "rating_by_star": 5
      },
      {
        "id_user": "hat11_user_02",
        "comment": "Fitment was on point. My favorite hat so far. I really like it",
        "image": ["hatComment12.jpg"],
        "video": [],
        "rating_by_star": 5
      },
      {
        "id_user": "hat11_user_03",
        "comment": "I got this hot for my dad as a gift for Christmas and he absolutely loved it. It was exactly what I was expecting and fit his head perfectly.",
        "image": [],
        "video": [],
        "rating_by_star": 4
      }
    ]
  },
  {
    "id": "hat12",
    "name": "adidas Superlite 2 Relaxed Adjustable Performance Cap",
    "description": "The adidas Superlite 2 Relaxed Adjustable Performance Cap is ready for a new adventure any day",
    "size": " One Size",
    "degree": 96,
    "image": ["hat33.jpg"],
    "date": [
      {
        "sell": "07/07/2022",
        "update": ""
      }
    ],
    "price": 60,
    "gender": "Male",
    "color": "Black",
    "category": "hat2",
    "status": "Stock",
    "quantity": 21,
    "amount": 28,
    "tag": ["adidas", "Men's Hat"],
    "rate": [
      {
        "id_user": "hat12_user_01",
        "comment": "These are very light hats and fit well for me. I actually bought a couple more, but one I got the wrong hat, and it was a \"womens fit\" that didn't show on the website but did on the hat, so just make sure if you get that rose colored one it's a SMALL fit, otherwise I really like the hats. Bought one for my son and he likes it also.",
        "image": [],
        "video": [],
        "rating_by_star": 5
      },
      {
        "id_user": "hat12_user_02",
        "comment": "Perfect for a very hot beach day or an outdoor activity. Fits wonderfully and this is my second hat. They have been with me on many international adventures in rain and extreme heat. They were great and served their purpose with style.",
        "image": [],
        "video": [],
        "rating_by_star": 4
      },
      {
        "id_user": "hat12_user_03",
        "comment": "Best hat I've ever put on my head! Great quality, perfect bill, smooth and sleek!",
        "image": [],
        "video": [],
        "rating_by_star": 5
      }
    ]
  },
  {
    "id": "hat13",
    "name": "Baseball Cap Adjustable Polo Trucker Unisex Style Head wear",
    "description": "THE HAT:Vintage Distressed Washed Style.100% Cotton Made.Lightweight / Durable / Smooth.Adjustable Metal Buckle Back Closure, Great Fit for Most Head Sizes.Dad Hat, Low Profile Unconstructed.Various Colors To Choose From.",
    "size": "22.6 - 23",
    "degree": 98,
    "image": ["hat34.jpg", "hat35.jpg", "hat36.jpg"],
    "date": [
      {
        "sell": "07/11/2022",
        "update": ""
      }
    ],
    "price": 18,
    "gender": "Male",
    "color": "Black",
    "category": "hat2",
    "status": "Stock",
    "quantity": 18,
    "amount": 12,
    "tag": ["Men's Hats", "Baseball Cap"],
    "rate": [
      {
        "id_user": "hat13_user_01",
        "comment": "Looooove! I got the darker gray. The hat fit my head right out of the box. No adjusting. The quality is great and this hat is super versatile! The fit is on pointe as well! Low profile and the brim is nicely rounded. I’m a 5’7 female. I wear this hat 3x per week? So much cuter than my 2 second ponytail when I’m playing taxi for my kids or ahem... needing a good shampooing.",
        "image": [],
        "video": [],
        "rating_by_star": 5
      },
      {
        "id_user": "hat13_user_02",
        "comment": "LOVE LOVE LOVE this hat!!! Perfect for my female small head. I bought this cause I wanted a hat that actually fit, and I was not disappointed. Other unisex hats have a huge brim, too much space in the forehead area, and sides that stick my ears out unless I tuck them in. Well no more, this is made for women and fits well and still provides sun protection.",
        "image": [],
        "video": [],
        "rating_by_star": 5
      },
      {
        "id_user": "hat13_user_03",
        "comment": "Good hat, love to wear hats when I don't feel like doing my natural curly hair. I also love that it doesn't have the Velcro in the back, instead it has the clip so my hair doesn't stick to it like the Velcro hats.",
        "image": [],
        "video": [],
        "rating_by_star": 4
      }
    ]
  },
  {
    "id": "hat14",
    "name": "Roxy Women's Truckin Trucker Hat",
    "description": "Trucker cap with mesh back in various graphics, adjustable back closure.",
    "size": "9 x 5 x 1 inches; 1.8 Ounces",
    "degree": 96,
    "image": ["hat37.jpg", "hat38.jpg", "hat39.jpg"],
    "date": [
      {
        "sell": "26/9/2022",
        "update": ""
      }
    ],
    "price": 46,
    "gender": "Female",
    "color": "Anthracite Perennial",
    "category": "hat1",
    "status": "Stock",
    "quantity": 17,
    "amount": 7,
    "tag": ["Trucker Hat", "Woman's Hat"],
    "rate": [
      {
        "id_user": "hat14_user_01",
        "comment": "This is NOT a real roxy hat. I have provided photos where as roxy puts their names all over the hat. This is a cheap knock off with a stolen Roxy Logo and fake Rocy retail tag attached to it. The hat is terrible flimsy material and completely differently shaped than authentic Roxy hats. I am returning it today. It also came in a soft pack with the bill and hat smashed completely flat. Save your time and money and buy a real roxy hat. Not some hat with a tag that says cobra made in china on it... selling these hats as a roxy hat is in fact theft.",
        "image": ["hatComment13.jpg", "hatComment14.jpg"],
        "video": [],
        "rating_by_star": 1
      },
      {
        "id_user": "hat14_user_02",
        "comment": "Never wore my hat on the last latch before. Runs small or it’s not really a Woman’s hat",
        "image": [],
        "video": [],
        "rating_by_star": 4
      },
      {
        "id_user": "hat14_user_03",
        "comment": "My 10 yo daughter loves her new hat. The bill seems a little shorter, which is not a problem, but might be worth mentioning.",
        "image": [],
        "video": [],
        "rating_by_star": 5
      }
    ]
  },
  {
    "id": "hat15",
    "name": "San Diego Hat Company Women's Poly Dress Hat",
    "description": "POLYESTER WOMEN’S HAT – Made from 100 percent polyester, this hat is crafted to look its best each time you wear it, making it ideal for dressy occasions.",
    "size": "One Size",
    "degree": 89,
    "image": ["hat40.jpg", "hat41.jpg", "hat42.jpg"],
    "date": [
      {
        "sell": "22/12/2022",
        "update": ""
      }
    ],
    "price": 37,
    "gender": "Female",
    "color": "Silver",
    "category": "hat1",
    "status": "Stock",
    "quantity": 15,
    "amount": 12,
    "tag": ["Women's Hats", "Dress Hat"],
    "rate": [
      {
        "id_user": "hat15_user_01",
        "comment": "Chose this hat for a derby party, very elegant looking, well made too.",
        "image": [],
        "video": [],
        "rating_by_star": 5
      },
      {
        "id_user": "hat15_user_02",
        "comment": "I bought this hat, and this one is my favorite so far in my collection. I love the minimalist look and the elegance that projects.",
        "image": [],
        "video": [],
        "rating_by_star": 5
      }
    ]
  },
  {
    "id": "glass1",
    "name": "Sun glasses Womens Mens Shades UV400 Sunnies SJ2050",
    "description": "These classic fashion sunglasses will bring you a timeless look and will be great choices for daily fashion accessories all year round. They are suitable for both men and women and suitable for any occasion and weather conditions.",
    "size": "Lens Width: 53mm | Lens Height: 44mm | Temple Length: 150mm | Nose Bridge: 22mm",
    "degree": 85,
    "image": ["glass1.jpg", "glass2.jpg", "glass3.jpg"],
    "date": [
      {
        "sell": "11/07/2022",
        "update":""
      }
    ],
    "price": 18,
    "gender": "Female",
    "color": "Amber Tortoise/Brown",
    "category": "fglass1",
    "status": "Stock",
    "quantity": 2,
    "amount": 2,
    "tag": ["Fashion Glasses", "Sun glasses"],
    "rate": [
      {
        "id_user": "glass1_user_01",
        "comment": "Love these! The frame color is perfect. just a nice warm goldish rose color. Also has nice gold earpieces which makes them look more expensive. The polarized brown lens is really nice on your eyes. I live in Hawaii so I have to have polarized lenses. They stay nice and tight on your head and are really comfortable too. They are a little bit bigger than a Ray Ban Wayfarer so a little more style e. But not too oversized of a frame.",
        "image": ["glassComment1.jpg"],
        "video": [],
        "rating_by_star": 5
      },
      {
        "id_user": "glass1_user_02",
        "comment": "I absolutely love these glasses!!! They aren't too big where they are overpowering and they flatter every head shape. I love them because they never get stuck in my hair and the metal earpieces fit perfectly and comfortably around my ears. Also, they actually to a great job blocking out the sun, compared to most stylish sunglasses. These are the perfect glasses to make every outfit look amazing, keep in the car, or wear everyday! Definitely my favorite sunglasses!!",
        "image": ["glassComment2.jpg"],
        "video": [],
        "rating_by_star": 5
      }
    ]
  },
  {
    "id": "glass2",
    "name": "Maui Jim Women's Orchid Cat-Eye Sun glasses",
    "description": "A pair of fashion sunglasses budding with lovely color, Orchid is inspired by the vibrant flower that often blooms beautiful and fragrant. Orchid's multi-colored frame options radiate personality, and are best for square or oblong face shapes.",
    "size": "Lens width: 56 millimeters; Lens height: 47 millimeters; Bridge: 19 millimeters; Arm: 140 millimeters",
    "degree": 95,
    "image": ["glass4.jpg", "glass5.jpg", "glass6.jpg"],
    "date": [
      {
        "sell": "20/9/2022",
        "update":""
      }
    ],
    "price": 80,
    "gender": "Female",
    "color": "Tortoise W/Peacock/Hcl Bronze Polarized",
    "category": "fglass1",
    "status": "Stock",
    "quantity": 12,
    "amount": 6,
    "tag": ["Glasses", "Cat-Eye"],
    "rate": [
      {
        "id_user": "glass2_user_01",
        "comment": "his is the 3rd pair of Maui Jim sunglasses and their styles keep on getting cuter! I recently broke my last pair that I had for 10 years and took s chance on the orchids. Zero regrets! So happy!",
        "image": ["glassComment3.jpg"],
        "video": [],
        "rating_by_star": 5
      },
      {
        "id_user": "glass2_user_02",
        "comment": "I live in Nevada & the sun shines brightly during the day. I like that I'm not squinting my eyes from the glare when I'm outside. I choose these to try before buying because of price. Compared it to designer wear glasses i.e. Prada, Coach etc. This was a better choice. The price meets the quality & need of what sunglasses are made for. Style, comfort & most important eye protection from sun damage. One person found this helpful",
        "image": [],
        "video": [],
        "rating_by_star": 5
      }
    ]
  },
  {
    "id": "glass3",
    "name": "Maui Jim Makaha Rimless Sun glasses",
    "description": "erfect for the thrill seeker in all of us, the Makaha features a Clear shell scratch coating, a proprietary, silicon-based hard coat that protects both sides of the lens against scratching. Polycarbonate Lens: For intense sports activities and active lifestyles, Maui Jim Polycarbonate lenses are optically correct to ensure crisp optics. They're lightweight, comfortable, extremely impact resistant, and feature our Clear shell scratch-resistant coating. PolarizedPlus2 Technology: All Maui Jim Sunglasses block glare and UV from all angles, manage blue light, and then boost colors for unmatched color, clarity, and contrast. Neutral Grey Lens offers contrast and the highest available light reduction. Suitable for all light conditions, especially bright, direct sunlight. 12% light transmission. ",
    "size": "7 x 3 x 2 inches; 0.5 Ounces",
    "degree": 98,
    "image": ["glass7.jpg", "glass8.jpg"],
    "date": [
      {
        "sell": "10/03/2022",
        "update":""
      }
    ],
    "price": 100,
    "gender": "Female",
    "color": "Tortoise/Bronze",
    "category": "fglass1",
    "status": "Stock",
    "quantity": 12,
    "amount": 4,
    "tag": ["glasses", "Mahaka"],
    "rate": [
      {
        "id_user": "glass3_user_01",
        "comment": "Great glasses. This is my 2nd pair. My 1st pair laster 4 years then the lens broke at the screw area. I will get the old pair repaired through maui for $75. They work great for a slimmer face. I definitely recomend these glasses. Take care of them & they will take care of you. Great for fishing or water life. Enjoy",
        "image": [],
        "video": [],
        "rating_by_star": 5
      },
      {
        "id_user": "glass3_user_02",
        "comment": "I really like Maui Jim sunglasses. My last pair lasted about 3 to 4 years before they started delaminating at the edges. These were a great deal and arrived spotless.",
        "image": [],
        "video": [],
        "rating_by_star": 4
      }
    ]
  }
]
