[
    {
        "id": "pant_01",
        "name": "Men's Straight-Fit Stretch Golf Pant",
        "description": "Amazon Essentials is focused on creating affordable, high-quality, and long-lasting everyday clothing you can rely on. Our line of men's must-haves includes polo shirts, chino pants, classic-fit shorts, casual button-downs, and crew-neck tees. Our consistent sizing takes the guesswork out of shopping, and each piece is put to the test to maintain the highest standards in quality and comfort.",
        "size": "32",
        "degree": 95,
        "image": ["golf_pant01.jpg", "golf_pant02.jpg", "golf_pant03.jpg", "golf_pant04.jpg", "golf_pant05.jpg"],
        "date": [
            {
                "sell": "10/08/2022",
                "update": ""
            }
        ],
        "price": 25.90,
        "gender": "male",
        "color": ["Khaki Brown", "Grey", "Navy"],
        "category": "pant2",
        "status": "stock", 
        "quantity": 3,
        "amount": 1,
        "tag": ["pant", "men's pant", "Men's Straight-Fit Stretch Golf Pant"],
        "rate": [
            {
                "id_user": "pant_user_01-1",
                "comment": "Material that the pants are made of, is nice. The front pockets are great for placing three golf balls per pocket in. There is a pair of rubber band material (non-elasticity) on the inside of the waist band. This stops your tucked in shirt to ride up while your playing golf.",
                "image": ["golf_pant_user01.jpg", "golf_pant_user02.jpg"],
                "video": [],
                "rating_by_star": 5
            }
        ]
    },
    {
        "id": "pant_02",
        "name": "PGA TOUR Men's Flat Front Golf Shorts with Active Waistband",
        "description": "Whether you're bending over to pick up your ball, mid-swing, or at barbecue with friends, these men’s shorts are a great addition to your golf apparel. The classic fit with a 9-inch inseam gives you a little extra room in the thigh, while the stretch fabric moves with you. An active waistband elevates your comfort, while moisture-wicking technology moves sweat away from your body. Play and look your best with the many performance features of these golf shorts.",
        "size": "35",
        "degree": 96,
        "image": ["pant_02-01.jpg", "pant_02-02.jpg", "pant_02-03.jpg", " pant_02-04.jpg"],
        "date": [
            {
                "sell": "06/08/2022",
                "update": "08/08/2022"
            }
        ],
        "price": 30.15,
        "gender": "male",
        "color": ["Caviar", "Black Iris"],
        "category": "pant2",
        "status": "stock",
        "quantity": 2,
        "amount": 3,
        "tag": ["pant", "men's pant", "Whether you're bending over to pick up your ball, mid-swing, or at barbecue with friends, these men’s shorts are a great addition to your golf apparel. The classic fit with a 9-inch inseam gives you a little extra room in the thigh, while the stretch fabric moves with you. An active waistband elevates your comfort, while moisture-wicking technology moves sweat away from your body. Play and look your best with the many performance features of these golf shorts."],
        "rate": [
            {
                "id_user": "pant_user_02-1",
                "comment": "Fit very well and was very comfortable. Most important is that they are 98% polyester and will maintain their shape even after washing.",
                "image": [],
                "video": [],
                "rating_by_star": 5
            },
            {
                "id_user": "pant_user_02-1",
                "comment": "Bought these to golf, and I am generally impressed with the quality of the “pga tour” clothes brand. The pants fit nicely, the size was accurate and they neat. They aren’t top quality shorts, but these are perfect for any golfer unless you are there to impress with brand names. Giving 4 star because the material quality could be slightly better.",
                "image": [],
                "video": [],
                "rating_by_star": 4
            }
        ]
    },
    {
        "id": "pant_03",
        "name": "HUDSON Men's Axl Slim Jean Rp",
        "description": "These blue jeans have a close, comfortable feel and feature a zipper fly, a button closure, and a belt-loop waistband. The 5-pocket construction leaves ample room for your phone and keys as you head out for a day with friends, and the mid-rise waist pairs with the straight-legged, slim-fit style for a modern, tapered profile. Available in multiple colors and sizes, this pant offers an attractive design with a relaxed, worn-in appearance. Made from 92% cotton, 6% elastomultiester, and 2% elastane for optimum stretch and comfort, it is machine washable on a gentle cycle.",
        "size": 32,
        "degree": 92,
        "image": ["pant_03-01.jpg", "pant_03-02.jpg", "pant_03-03.jpg", "pant_03-04.jpg"],
        "date": [
            {
                "sell": "07/08/2022",
                "update": ""
            }
        ],
        "price": 21.5,
        "gender": "male",
        "color": "Mar Vista",
        "category": "pant2",
        "status": "stock",
        "quantity": 1,
        "amount": 1,
        "tag": ["pant", "men's pant", "HUDSON Men's Axl Slim Jean Rp"],
        "rate": [
            {
                "id_user": "pant_user_03-1",
                "comment": "Soft, durable pants that have faded beyond all reason. We ordered black and now they're gray. I only wash in child with Tide. My son wore them to work as a server and after a month he was told he couldn't wear them anymore. If color doesn't matter, the material had held up. Good for working where appearance doesn't matter.",
                "image": [],
                "video": [],
                "rating_by_star": 3
            }
        ]
    },
    {
        "id": "pant_04",
        "name": "Men's Classic-Fit Wrinkle-Resistant Flat-Front Chino Pant",
        "description": "An Amazon brand - A flat-front wrinkle-resistant dressy chino pant that offers classic style all week long",
        "size": "33",
        "degree": 99, 
        "image": ["pant_04-01.jpg", "pant_04-02.jpg", "pant_04-03.jpg", "pant_04-04.jpg"],
        "date": [
            {
                "sell": "01/07/2022",
                "update": "03/07/2022"
            }
        ],
        "price": 22.09,
        "gender": "male",
        "color": ["Grey", "Navy", "Stone"],
        "category": "pant2",
        "status": "stock",
        "quantity": 4,
        "amount": 3,
        "tag": ["pant", "men's pant", "Men's Classic-Fit Wrinkle-Resistant Flat-Front Chino Pant"],
        "rate": [
            {
                "id_user": "pant_user_04-1",
                "comment": "Perfect for life on the go. These slacks are what I need to stay looking and feeling good.",
                "image": ["pant_user_04-01.jpg", "pant_user_04-02.jpg"],
                "video": [],
                "rating_by_star": 5
            },
            {
                "id_user": "pant_user_04-2",
                "comment": "These are great, if not perfect, dress slacks. I purchased the blue pair and they fit comfortable, give just enough room to be comfy and not too tight, but damn do they ever collect hairs and random bits and pieces of fluff. I have worn them a handful of times and had to run a lint collector over them twice a day to ensure I do not look like a homeless guy who walked through a petting zoo. I would not call these Wrinkle-Free but certainly Wrinkle-Resistant, by the afternoon of sitting at a desk you will have wrinkles.",
                "image": [],
                "video": [],
                "rating_by_star": 4
            },
            {
                "id_user": "pant_user_04-3",
                "comment": "The fit in the waist and the length is just what I expected. They are comfortable and affordable, which means that you can get several colors to go with your wardrobe and not worry about breaking the bank.",
                "image": ["pant_user_04-03.jpg", "pant_user_04-04.jpg"],
                "video": [],
                "rating_by_star": 5
            }
        ]
    },
    {
        "id": "pant_05",
        "name": "Lee Men's Performance Series Extreme Comfort Straight Fit Pant",
        "description": "Just like our founder, H.D. Lee, our passion is helping can-do people do more. We are committed to designing clothing that conforms to your body, allowing you to move through life freely. We help you chase the things that bring you joy and laughter. The things that make you fearless and hopefully because your passion is what makes you unique. And what moves you, moves us. Move your Lee.",
        "size": 38,
        "degree": 96,
        "image": ["pant_05-01.jpg", "pant_05-01.jpg", "pant_05-01.jpg"],
        "date": [
            {
                "sell": "20/07/2022",
                "update": "25/07/2022"
            }
        ],
        "price": 48,
        "gender": "male",
        "color": ["Bronze", "Black"],
        "category": "pant2",
        "status": "stock",
        "quantity": 2,
        "amount": 1,
        "tag": ["pant", "men's pant", "Lee Men's Performance Series Extreme Comfort Straight Fit Pant"],
        "rate": [
            {
                "id_user": "pant_user_05-1",
                "comment": "In the next batch I received one right out of the box that had a pocket ripped in two sides. Interestingly enough, the pockets are made of a stretchy mesh that is sewn in the center and when you pull them inside out and tug on both sides, you can see the mesh struggle against that thread. This worried me with my other pairs when I inspected them and before another month had passed I already had another hole in my pocket where I keep my keys.",
                "image": [],
                "video": [],
                "rating_by_star": 2
            }
        ]
    },
    {
        "id": "pant_06",
        "name": "IZOD Men's Golf Swingflex Straight Fit Pant",
        "description": "Perfect your stroke in comfort. This golf pant is enhanced with a swing flex waistband featuring four-way stretch for ultimate range of motion. Moisture-wicking fabric keeps you dry all day, while a uv-20 finish makes sure you play it safe each round.",
        "size": "35",
        "degree": 96, 
        "image": ["pant_06-01.jpg", "pant_06-02.jpg", "pant_06-03.jpg"],
        "date": [
            {
                "sell": "21/07/2022",
                "update": ""
            }
        ],
        "price": 42.00,
        "gender": "male",
        "color": ["Asphault", "Cinder Block"],
        "category": "pant2",
        "status": "stock",
        "quantity": 2,
        "amount": 2,
        "tag": ["pant", "men's pant", "IZOD Men's Golf Swingflex Straight Fit Pant"],
        "rate": [
            {
                "id_user": "pant_user_06-1",
                "comment": "There's absolutely nothing bad I can say about these pants. They fit as I expected, bought the same size as my jeans.Slightly stretchy, lightweight, and a stretchy waistband. Exactly like the Nike's my wife bought me, only a fraction of the price. Get these pants, you won't be disappointed.",
                "image": [],
                "video": [],
                "rating_by_star": 5
            },
            {
                "id_user": "pant_user_06-2",
                "comment": "Very light weight. Used them in restaurants as work pants since the kitchen was hot they keep cool and not make you fell like your over heating. The elastic waist band makes for a relaxed concert and they don't wrinkle easily and are slightly water resistant.",
                "image": [],
                "video": [],
                "rating_by_star": 5
            }
        ]
    },
    {
        "id": "pant_07",
        "name": "SPECIALMAGIC Golf Pants Men Stretch Slim fit Hiking Pants Lightweight Dress Casual Tapered Zipper Pockets",
        "description": "Feel great on the course with this performance-packed golf pant from PGA TOUR. Featuring moisture-wicking properties, enhanced stretch fabric for unrestricted movement, UPF grade sun protection, and an expandable waistband - you'll be prepared for anything the course throws at you.",
        "size": 30,
        "degree": 90,
        "image": ["pant_07-01.jpg", "pant_07-02.jpg", "pant_07-03.jpg"],
        "date": [
            {
                "sell": "14/07/2022",
                "update": ""
            }
        ],
        "price": 36.55,
        "gender": "male",
        "color": ["Navy", "Black"],
        "category": "pant2",
        "status": "stock",
        "quantity": 5,
        "amount": 1,
        "tag": ["pant", "men's pant", "SPECIALMAGIC Golf Pants Men Stretch Slim fit Hiking Pants Lightweight Dress Casual Tapered Zipper Pockets"],
        "rate": [
            {
                "id_user": "pant_user_07-1",
                "comment": "I was looking for a lighweight pair of pants for golf. Got rave comments about these. Fits well. Narrow at the calf but overall goodlooking pair with belt loops. Stretching fabric. Also great for hiking.",
                "image": [],
                "video": [],
                "rating_by_star": 5
            }
        ]
    },
    {
        "id": "pant_08",
        "name": "Champion Men's Powerblend Fleece Joggers, Left Hip C",
        "description": "Since 1919 Champion has inspired athletes on and off the field with its authentic, American athletic apparel. From iconic Champion active wear to the latest in performance workout clothes for men, women and kids, you'll find quality sportswear for every level of play.",
        "size": 37,
        "degree": 88, 
        "image": ["pant_08-01.jpg", "pant_08-02.jpg", "pant_08-03.jpg"],
        "date": [
            {
                "sell": "20/06/2022",
                "update": ""
            }
        ],
        "price": 30.45,
        "gender": "male",
        "color": ["Black"],
        "category": "pant2",
        "status": "stock",
        "quantity": 2,
        "amount": 0,
        "tag": ["pant", "men's pant", "Champion Men's Powerblend Fleece Joggers, Left Hip C"],
        "rate": [
            
        ]
    },
    {
        "id": "pant_09",
        "name": "Champion Sweatpants Men's Big and Tall Heavyweight Fleece Joggers",
        "description": "Closed bottom jersey men workout pants are made from 80% Cotton fabric, heavyweight fleece, breathable and quick dry. These mens sweatpants have 4-way stretch sports material to provide more comfortable feeling; when the movement is strong or the temperature is high, the moisture wicking cool dry fabric can take away the sweat of legs quickly. Heavyweight keeps you warm while you exercise. These casual mens jogger pants can be worn anywhere. Active quick-dri mens jersey sweatpants are elastic waist pants for men, breathable and perfect for the gym or anywhere else. Features: Skin-friendly material keeps your skin comfortable and lets your muscles breathe while the movement. Two hand pockets to securely store your essentials and the trendy looks elastic waistband with functional drawstring can be used freely Quick dry sleepwear pants for men, great for indoor and outdoor activities like jogging. If you're looking for a pair of athletic mens pants, joggers for men, mens sweat pants, with pockets, men's sports sweatpants, or just mens sweats, these Champion Big and Tall pants for men have you covered. Specifications: Material: 80% Cotton, 20% Polyester Sizes: Large tall, X-large big tall, 2X, 2x-tall, 3X, 3X- tall, 4X, 4X-tall, 5X & 6X Colors: Black sweatpants for men, Charcoal Heather grey sweatpants, Navy & white men's big & tall pants.",
        "size": 36,
        "degree": 96, 
        "image": ["pant_09-01.jpg", "pant_09-02.jpg", "pant_09-03.jpg"],
        "date": [
            {
                "sell": "30/06/2022",
                "update": "02/07/2022"
            }
        ],
        "price": 29.99,
        "gender": "male",
        "color": ["Heather Grey", "Charcoal"],
        "category": "pant2",
        "status": "stock", 
        "quantity": 2,
        "amount": 2,
        "tag": ["pant", "men's pant", "Champion Sweatpants Men's Big and Tall Heavyweight Fleece Joggers"],
        "rate": [
            {
                "id_user": "pant_user_09-1",
                "comment": "It said heavy weight more like medium. We have some old Champion sweats that are truly heavy weight. But it is still nice material and will keep them",
                "image": [],
                "video": [],
                "rating_by_star": 3 
            },
            {
                "id_user": "pant_user_09-2",
                "comment": "It said heavy weight more like medium. We have some old Champion sweats that are truly heavy weight. But it is still nice material and will keep them",
                "image": [],
                "video": [],
                "rating_by_star": 4
            }
        ]
    },
    {
        "id": "pant_10",
        "name": "Wangdo Men's Workout Shorts 7 Running Shorts Athletic Bike Shorts Gym Shorts for Men with Zipper Pocket",
        "description": "【BREATHABLE MESH FABRIC WITH LINING】The men's running shorts is lightweight quick-dry fabric and designed to keep you comfortable for workouts and practice.Increased lining to prevent SEE-THRU,you can rest assured to buy light colors without worrying.【LARGER ZIPPER POCKETS AFTER UPGRADE】Our Gym shorts have been proposed and improved by customers, we made bigger zipper pockets on both sides than before,so you can keep your phone or other valuables safe and secure during your workout.【ELASTIC WAISTBAND & INNER DRAWCORD】Featured elastic can perfect suit your waist. Inner drawstring ensures shorts don’t sliding down when running, which makes you can do the exercises without sorrow and anxiety.",
        "size": 36,
        "degree": 96,
        "image": ["pant_10-01.jpg", "pant_10-02.jpg", "pant_10-03.jpg"],
        "date": [
            {
                "sell": "14/07/2022",
                "update": ""
            }
        ],
        "price": 30.96,
        "gender": "male",
        "color": ["Black", "White"],
        "category": "pant2",
        "status": "stock",
        "quantity": 4,
        "amount": 1,
        "tag": ["pant", "men's pant", "Wangdo Men's Workout Shorts 7 Running Shorts Athletic Bike Shorts Gym Shorts for Men with Zipper Pocket"],
        "rate": [
            {
                "id_user": "pant_user_10-1",
                "comment": "These are pretty nice lightweight breathable shorts for the gym, and even for casual wear. The pockets are deep, you can definitely fit whatever you possibly need inside of them. The drawstrings are a bit too big, there’s quite the load of slack even when the waist is stretched out. The logos and fabric are pretty average in quality, but they hold up very well. My favorite part about these shorts definitely Hass to be the metal tips on the strings, at the base of the drawstrings, and the zippers. Other than that, these shorts fit well. They right above the knee and when stretching your legs, they come about halfway up the quads. If you don’t like high riding shorts when sitting down, definitely don’t buy these. In terms of sizing, the shorts are definitely fit true to size. The only complaint I have with these shorts is that the crotch area is a little on the less-roomy side. Besides that, they’re a great pair of shorts.",
                "image": ["pant_user_10-01.jpg", "pant_user_10-02.jpg", "pant_user_10-03.jpg"],
                "video": [],
                "rating_by_star": 
            }
        ]
    },
    {
        "id": "pant_11",
        "name": "Men's Slim-Fit Casual Stretch Khaki Pant",
        "description": "Amazon Essentials is focused on creating affordable, high-quality, and long-lasting everyday clothing you can rely on. Our line of men’s must-haves includes polo shirts, chino pants, classic-fit shorts, casual button-downs, and crew-neck tees. Our consistent sizing takes the guesswork out of shopping, and each piece is put to the test to maintain the highest standards in quality and comfort.",
        "size": 35,
        "degree": 98, 
        "image": ["pant_11-01.jpg", "pant_11-02.jpg", "pant_11-03.jpg", "pant_11-04.jpg"],
        "date": [
            {
                "sell": "20/07/2022",
                "update": "21/07/2022"
            }
        ],
        "price": 25.01,
        "gender": "male",
        "color": ["Black", "Grey"],
        "category": "pant2",
        "status": "stock",
        "quantity": 2,
        "amount": 3,
        "tag": ["pant", "men's pant", "Men's Slim-Fit Casual Stretch Khaki Pant"],
        "rate": [
            {
                "id_user": "pant_user_11-1",
                "comment": "These are the best pants ever. I'm 6'7' and it's hard for me to find pants that fit me this nice. I'm going to get them in every color.",
                "image": ["pant_user_11-01.jpg"],
                "video": [],
                "rating_by_star": 5
            },
            {
                "id_user": "pant_user_11-2",
                "comment": "Being a short guy, it's not often you can find inseams that really fit you. Often I have to take it to the tailors. They also have every single size which is also rare. Normally you have to go up two sizes. The material is ok. I just got it and haven't washed it yet nor wore it around much. I was just stoked by how well they fit! I say the material is only ok because it's pretty much standard like you would find anywhere else. It's not crappy but it's not super fine either.",
                "image": [],
                "video": [],
                "rating_by_star": 4
            }
        ]
    },
    {
        "id": "pant_12",
        "name": "Goodthreads Men's Skinny-Fit Washed Comfort Stretch Chino Pant",
        "description": "We've always loved traditional men’s chino pants, but we wanted a little more - something that would keep the classic men’s tailored pants style, but add in subtle enhancements that would keep us comfortable no matter what we got into. vineyard vines slim fit Breaker Pants keep all of the tried-and-true style of a pair of classic chinos, with the added stretch and out-of-the-box softness that we (and you) love. They’re the perfect choice for wherever life takes you, as golf pants for men, casual pants for men and so much more. Make sure it’s vineyard vines quality: look for “Ships from and sold by Amazon” at the top of the page, under the product title. At vineyard vines, we think every day should feel this good! We are family owned and operated since 1998. For over 20 years, we’ve been sharing the gift of the Vineyard with everyone we can. Care Instructions: machine wash.",
        "size": 35,
        "degree": 96, 
        "image": ["pant_12-01.jpg", "pant_12-02.jpg", "pant_12-03.jpg"],
        "date": [
            {
                "sell": "18/07/2022",
                "update": ""
            }
        ],
        "price": 32,
        "gender": "male",
        "color": ["Black", "Grey", "White"],
        "category": "pant2",
        "status": "stock",
        "quantity": 4,
        "amount": 2,
        "tag": ["pant", "men's pant", "Goodthreads Men's Skinny-Fit Washed Comfort Stretch Chino Pant"],
        "rate": [
            {
                "id_user": "pant_user_12-1",
                "comment": "I am tall and skinny and these pants fit perfect. It's really hard to find pants. So if you buy these pants I'll be sad because Ill have to walk around naked because all the pants will be gone. I love these pants don't make me pants-less.",
                "image": [],
                "video": [],
                "rating_by_star": 5
            },
            {
                "id_user": "pant_user_12-2",
                "comment": "First these pants are not skinny, they are slim. Which is fine, that's what I wanted. But beware....I ordered three pairs all the same size: navy, green and british khaki. All 32x28. The navy and green are perfect, the british khaki are too tight. The quality control is not good. But I am keeping all three pairs, because its hard finding good pants in the right size. So just keep that in mind when you order.",
                "image": [],
                "video": [],
                "rating_by_star": 4
            }
        ]
    },
    {
        "id": "pant_13",
        "name": "Vineyard vines Men's Chino Breaker Pant with New Slim Fit Cut",
        "description": "They’re the perfect choice for wherever life takes you, as golf pants for men, casual pants for men and so much more. Make sure it’s vineyard vines quality: look for “Ships from and sold by Amazon” at the top of the page, under the product title. At vineyard vines, we think every day should feel this good! We are family owned and operated since 1998. For over 20 years, we’ve been sharing the gift of the Vineyard with everyone we can. Care Instructions: machine wash.",
        "size": 34,
        "degree": 89,
        "image": ["pant_13-01.jpg", "pant_13-02.jpg", "pant_13-03.jpg"],
        "date": [
            {
                "sell": "07/08/2022",
                "update": ""
            }
        ],
        "price": 78.88,
        "gender": "male",
        "color": ["Black", "White"],
        "category": "pant2",
        "status": "stock",
        "quantity": 2,
        "amount": 0,
        "tag": ["pant", "men's pant", "Vineyard vines Men's Chino Breaker Pant with New Slim Fit Cut"],
        "rate": [
            {
                "id_user": "pant_user_13-1",
                "comment": "Ordered two pairs in Stone and white for my husband to try and on, as we will be attending our nieces beach wedding. Was not sure if they would fit and look good. Well, they fit perfectly and look great. He said they are very comfortable and light weight. Stylish too. Was not sure on the color, but my husband wants to keep both pants. A win, win. ",
                "image": [],
                "video": [],
                "rating_by_star": 5
            },
            {
                "id_user": "pant_user_13-2",
                "comment": "These are a tray good fit. Truer to size and very good quality material. Will be back and recommend it especially for the price and able to get in days.",
                "image": [],
                "video": [],
                "rating_by_star": 5 
            }
        ]
    },
    {
        "id": "pant_14",
        "name": "IZOD Men's Saltwater 5-Pocket Straight Fit Chino Pant",
        "description": "Crafted from a stretch cotton blend, this flat-front chino combines form and function, making it the perfect complement to your active lifestyle.",
        "size": 36,
        "degree": 96,
        "image": ["pant_14-01.jpg", "pant_14-02.jpg", "pant_14-03.jpg"],
        "date": [
            {
                "sell": "28/07/2022",
                "update": ""
            }
        ],
        "price": 39.66,
        "gender": "male",
        "color": ["Black", "White", "Caviar"],
        "category": "pant2",
        "status": "stock",
        "quantity": 2,
        "amount": 2,
        "tag": ["pant", "men's pant", "IZOD Men's Saltwater 5-Pocket Straight Fit Chino Pant"],
        "rate": [
            {
                "id_user": "pant_user_13-1",
                "comment": "Ordered two pairs in Stone and white for my husband to try and on, as we will be attending our nieces beach wedding. Was not sure if they would fit and look good. Well, they fit perfectly and look great. He said they are very comfortable and light weight. Stylish too. Was not sure on the color, but my husband wants to keep both pants. A win, win. ",
                "image": [],
                "video": [],
                "rating_by_star": 5
            },
            {
                "id_user": "pant_user_13-2",
                "comment": "These are a tray good fit. Truer to size and very good quality material. Will be back and recommend it especially for the price and able to get in days.",
                "image": [],
                "video": [],
                "rating_by_star": 5 
            }
        ]
    },
    {
        "id": "pant_15",
        "name": "IZOD Men's Saltwater Stretch Flat Front Straight Fit Chino Pant",
        "description": "Crafted from a stretch cotton blend, this flat-front chino combines form and function, making it the perfect complement to your active lifestyle.",
        "size": 36,
        "degree": 96,
        "image": ["pant_15-01.jpg", "pant_15-02.jpg", "pant_05-01.jpg"],
        "date": [
            {
                "sell": "28/07/2022",
                "update": ""
            }
        ],
        "price": 39.66,
        "gender": "male",
        "color": ["Black", "White", "Caviar"],
        "category": "pant2",
        "status": "stock",
        "quantity": 2,
        "amount": 2,
        "tag": ["pant", "men's pant", "IZOD Men's Saltwater 5-Pocket Straight Fit Chino Pant"],
        "rate": [
            {
                "id_user": "pant_user_13-1",
                "comment": "Ordered two pairs in Stone and white for my husband to try and on, as we will be attending our nieces beach wedding. Was not sure if they would fit and look good. Well, they fit perfectly and look great. He said they are very comfortable and light weight. Stylish too. Was not sure on the color, but my husband wants to keep both pants. A win, win. ",
                "image": [],
                "video": [],
                "rating_by_star": 5
            },
            {
                "id_user": "pant_user_13-2",
                "comment": "These are a tray good fit. Truer to size and very good quality material. Will be back and recommend it especially for the price and able to get in days.",
                "image": [],
                "video": [],
                "rating_by_star": 5 
            }
        ]
    },



    {
        "id": "pant_16",
        "name": "Lee Women's Flex Motion Regular Fit Trouser Pant",
        "description": "Just like our founder,  H.D. Lee, our passion is helping can-do people do more. We are committed to designing clothing that conforms to your body, allowing you to move through life freely. We help you chase the things that bring you joy and laughter. The things that make you fearless and hopefully because your passion is what makes you unique. And what moves you, moves us. Move your Lee.",
        "size": "6 Long",
        "degree": 99,
        "image": ["pant_16-01.jpg", "pant_16-02.jpg", "pant_16-03.jpg", "pant_16-04.jpg"],
        "date": [
            {
                "sell": "28/07/2022",
                "update": ""
            }
        ],
        "price": 50.55,
        "gender": "female",
        "color": ["Black", "White", "Caviar"],
        "category": "pant2",
        "status": "stock",
        "quantity": 2,
        "amount": 3,
        "tag": ["pant", "men's pant", "Lee Women's Flex Motion Regular Fit Trouser Pant"],
        "rate": [
            {
                "id_user": "pant_user_16-1",
                "comment": "They are pretty good bootleg pants if that’s what you like, I do. I would say they run a little small and the waist is pretty tight with no give. I wear 10P in basically all my pants and I’ve actually lost a little weight recently and a lot of my pants are feeling a little big but these definitely feel tight but wearable if I have my spanx tummy control on. They are like most dress pants and aren’t booty flattering in my opinion but Could just be my booty! I still like them over some of the other horrible pants that I have got and I am keeping them.",
                "image": ["pant_user_16-01.jpg", "pant_user_16-02.jpg", "pant_user_16-03.jpg"],
                "video": [],
                "rating_by_star": 5
            },
            {
                "id_user": "pant_user_16-2",
                "comment": "I’ve been searching for boot cut work pants, with stretch and pockets for years with no luck. I ordered these pants in 3 different colours/patterns and I wasn’t disappointed. They are the perfect work pant. They also have a reinforced thick waist which makes it so I don’t need a belt. The fit a bit relaxed on my thigh but I can look past that since they fit great in the waist and in length.",
                "image": [],
                "video": [],
                "rating_by_star": 5
            }
        ]
    },
    {
        "id": "pant_17",
        "name": "Lee Women's Relaxed Fit All Day Straight Leg Pant",
        "description": "LEE Women’s Relaxed Fit All Day Straight Leg Pant. Previously known as the All Day Pant, these pants are made for all day wear with silky-soft fabric and a slight drape. Overall Fit: Relaxed fit pant. Rise: Mid rise, sits at the natural waist. Closure: Zip-Fly with button closure. Leg: Straight fit through the seat, leg, and thigh. Pockets: Four pockets: (2) welt back pockets, (2) front pockets. Inseam: Short 29-inches, Medium 31-inches, Long 33-inches. BRAND HERITAGE: Just like our founder, H.D. Lee, our passion is helping can-do people do more. We are committed to designing clothing that conforms to your body, allowing you to move through life freely. We help you chase the things that bring you joy and laughter. The things that make you fearless and hopefully because your passion is what makes you unique. And what moves you, moves us. Move your Lee.",
        "size": "12",
        "degree": 89,
        "image": ["pant_17-01.jpg", "pant_17-02.jpg", "pant_17-03.jpg"],
        "date": [
            {
                "sell": "28/07/2022",
                "update": ""
            }
        ],
        "price": 30.69,
        "gender": "female",
        "color": ["Black", "White", "Caviar"],
        "category": "pant2",
        "status": "stock",
        "quantity": 2,
        "amount": 1,
        "tag": ["pant", "men's pant", "Lee Women's Relaxed Fit All Day Straight Leg Pant"],
        "rate": [
            {
                "id_user": "pant_user_17-1",
                "comment": "Finally found dress pants that fit in length and nicely in the waist. Could have gone a size smaller, but didn't want to take the chance of the waist being too tight. These are a little large in the rear end, but I can live with it. So much so, I ordered 4 more, with different colours.",
                "image": [],
                "video": [],
                "rating_by_star": 5
            }
        ]
    },
    {
        "id": "pant_18",
        "name": "Lee Women's Flex Motion Regular Fit Straight Leg Jean",
        "description": "Just like our founder,  H.D. Lee, our passion is helping can-do people do more. We are committed to designing clothing that conforms to your body, allowing you to move through life freely. We help you chase the things that bring you joy and laughter. The things that make you fearless and hopefully because your passion is what makes you unique. And what moves you, moves us. Move your Lee. Closure Type: Zip-Fly with button closure",
        "size": 14,
        "degree": 96,
        "image": ["pant_18-01.jpg", "pant_18-02.jpg", "pant_18-03.jpg"],
        "date": [
            {
                "sell": "28/07/2022",
                "update": ""
            }
        ],
        "price": 36.94,
        "gender": "female",
        "color": ["Black", "White", "Caviar"],
        "category": "pant2",
        "status": "stock",
        "quantity": 2,
        "amount": 0,
        "tag": ["pant", "men's pant", "Lee Women's Flex Motion Regular Fit Straight Leg Jean"],
        "rate": [
        ]
    },
    {
        "id": "pant_19",
        "name": "Fruit of the Loom Women's Essentials French Terry Pants and Tri-Blend Tees",
        "description": "The Fruit of the Loom women's essentials collection features must-have pieces that are essential to every woman's wardrobe. Dressed up for work, or dressed down for comfort, these versatile pieces provide day to night wear ability. The live in open bottom pant is perfect for relaxing with the family or running around town. Made of super soft French terry fabric, you are sure to feel cozy and look stylish. These pants come in a variety of sophisticated colors to elevate your existing wardrobe, and you can find coordinating pieces in the essentials collection to complement this quintessential item.",
        "size": 12,
        "degree": 96, 
        "image": ["pant_19-01.jpg", "pant_19-02.jpg", "pant_19-03.jpg"],
        "date": [
            {
                "sell": "28/07/2022",
                "update": ""
            }
        ],
        "price": 23.88,
        "gender": "female",
        "color": ["Black", "White", "Caviar"],
        "category": "pant2",
        "status": "stock",
        "quantity": 3,
        "amount": 2,
        "tag": ["pant", "men's pant", "Fruit of the Loom Women's Essentials French Terry Pants and Tri-Blend Tees"],
        "rate": [
            {
                "id_user": "pant_user_19-1",
                "comment": "Fabric is darker than shown (I got the grey), material is scratchy, thin and shapeless. Ugly pants and not worth it even at this price point. Instant return. I wear a size 10I got a size Large. They fit awkwardly. It does not feel like they were made for a woman's body at all, the hips are snug and the waistband is loose, the legs are tight until the ankles so they just look terrible.",
                "image": [],
                "video": [],
                "rating_by_star": 5
            }
        ]
    },
    {
        "id": "pant_20",
        "name": "Hanes Women's French Terry Pocket Pant",
        "description": "Hanes women's French terry pocket pant is cotton rich for extra softness. The French terry fabric is smooth outside and brushed inside for extra comfort. Side pockets and adjustable draw cord waist",
        "size": 13,
        "degree": 96,
        "image": ["pant_20-01.jpg", "pant_20-02.jpg", "pant_20-03.jpg"],
        "date": [
            {
                "sell": "10/08/2022",
                "update": ""
            }
        ],
        "price": 18.66,
        "gender": "female",
        "color": ["Black", "White", "Caviar"],
        "category": "pant2",
        "status": "stock",
        "quantity": 5,
        "amount": 0,
        "tag": ["pant", "men's pant", "Hanes Women's French Terry Pocket Pant"],
        "rate": [
           
        ]
    },
    {
        "id": "pant_21",
        "name": "Lee Women's Relaxed-Fit Capri Pant",
        "description": "Just like our founder,  H.D. Lee, our passion is helping can-do people do more. We are committed to designing clothing that conforms to your body, allowing you to move through life freely. We help you chase the things that bring you joy and laughter. The things that make you fearless and hopefully because your passion is what makes you unique. And what moves you, moves us. Move your Lee. Fit Type: Relaxed; Closure Type: Zip-Fly with button closure",
        "size": 13,
        "degree": 97,
        "image": ["pant_21-01.jpg", "pant_21-02.jpg", "pant_21-03.jpg"],
        "date": [
            {
                "sell": "18/07/2022",
                "update": ""
            }
        ],
        "price": 23.51,
        "gender": "female",
        "color": ["Black", "White", "Caviar"],
        "category": "pant2",
        "status": "stock",
        "quantity": 3,
        "amount": 2,
        "tag": ["pant", "men's pant", "Lee Women's Relaxed-Fit Capri Pant"],
        "rate": [
            {
                "id_user": "pant_user_21-1",
                "comment": "My only complaint is that they are not at the waist. Otherwise I like them. I wish Lee would make a category for those who only want at the waist pants. Trying to search through all the options is time consuming and not very fruitful.",
                "image": [],
                "video": [],
                "rating_by_star": 4
            },
            {
                "id_user": "pant_user_21-2",
                "comment": "Lee Capris fit perfect and run true to size table listed on the site. I purchased the same ones about 4 yrs ago and they are just now starting to show wear. Comfort, quality and durability are the main reasons I’m a repeat customer.",
                "image": [],
                "video": [],
                "rating_by_star": 5
            }
        ]
    },
    {
        "id": "pant_22",
        "name": "Core 10 Women's Woven Jogger Pant",
        "description": "",
        "size": 15,
        "degree": 97,
        "image": ["pant_22-01.jpg", "pant_22-02.jpg", "pant_22-03.jpg"],
        "date": [
            {
                "sell": "01/07/2022",
                "update": ""
            }
        ],
        "price": 30.55,
        "gender": "female",
        "color": ["Black", "Grey", "Navy"],
        "category": "pant2",
        "status": "stock",
        "quantity": 5,
        "amount": 3,
        "tag": ["pant", "men's pant", "Core 10 Women's Woven Jogger Pant"],
        "rate": [
            {
                "id_user": "pant_user_22-1",
                "comment": "These pants are fine with one exception; the waistband. The waistband is a wide strip of elastic and it is constantly twisted or folded over. Super annoying! And, this also causes the waist to look puffy. You don’t want these pants.",
                "image": [],
                "video": [],
                "rating_by_star": 3
            },
            {
                "id_user": "pant_user_22-2",
                "comment": "Loves it! The fit is a little bit on the larger side...but I am using them as scrub pants so it's ok like that. The lenght is perfect for me. Very comfy and light. I am 5ft2, 125 pounds and ordered a size small.",
                "image": [],
                "video": [],
                "rating_by_star": 5
            }
        ]
    }
]